#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "rus");
	int x1, y1; //Первая клетка
	int x2, y2; //Вторая клетка
	int num; //Номер фигуры
	printf("Введите координаты первой клетки X и Y (через пробел): ");
	scanf_s("%d %d", &x1, &y1);
	printf("\nВведите координаты второй клетки X и Y (через пробел): ");
	scanf_s("%d %d", &x2, &y2);
	if (x1 <= 8 && x2 <= 8 && y1 <= 8 && y2 <= 8)
	{
		printf("Какой фигурой будем ходить?\n 1. Король\n 2. Ферзь\n 3. Ладья\n 4. Слон\n 5. Конь\n Введите номер: ");
		scanf_s("%d", &num);

		switch (num)
		{
		case 1:
			if ((x1 - x2 <= 1 && x1 - x2 >= -1) && (y1 - y2 <= 1 && y1 - y2 >= -1) && num == 1)
			{
				printf("Король перемещен!");
				break;
			}
		case 3:
			if ((x1 == x2 || y1 == y2) && num == 3)
			{
				printf("Ладья перемещена!");
				break;
			}
		case 4:
			if (  (  ((x1 + y1) % 2 == 0 && (x2 + y2) % 2 == 0) || ((x1 + y1) % 2 == 1 && (x2 + y2) % 2 == 1)  )  && num == 4)
			{
				printf("Слон перемещен!");
				break;
			}
		case 5:
			if ((((x1 + y1 + 1 == x2 + y2) || (x1 + y1 - 1 == x2 + y2)) || ((x1 + y1 + 3 == x2 + y2) || (x1 + y1 - 3 == x2 + y2))) && num == 5)
			{
				printf("Конь перемещен!");
				break;
			}
		case 2:
			if (((x1 - x2 <= 1 && x1 - x2 >= -1) && (y1 - y2 <= 1 && y1 - y2 >= -1) || (x1 == x2 || y1 == y2) || (((x1 + y1) % 2 == 0 && (x2 + y2) % 2 == 0) || ((x1 + y1) % 2 == 1 && (x2 + y2) % 2 == 1))) && num == 2)
			{
				printf("Ферзь перемещен!");
				break;
			}
		default:
		{
			printf("Выбранная вами фигура не может сделать ход.\nВот список остальных фигур, которые могут сходить: \n");
			switch (num)
			{
			case 1:
				if ((x1 - x2 <= 1 && x1 - x2 >= -1) && (y1 - y2 <= 1 && y1 - y2 >= -1))
				{
					printf("* Король\n");
				}
			case 3:
				if ((x1 == x2 || y1 == y2))
				{
					printf("* Ладья\n");
				}
			case 4:
				if ((   ((x1 + y1) % 2 == 0 && (x2 + y2) % 2 == 0) || ((x1 + y1) % 2 == 1 && (x2 + y2) % 2 == 1)   ))
				{
					printf("* Слон\n");
				}
			case 5:
				if ((((x1 + y1 + 1 == x2 + y2) || (x1 + y1 - 1 == x2 + y2)) || ((x1 + y1 + 3 == x2 + y2) || (x1 + y1 - 3 == x2 + y2))) && num == 5)
				{
					printf("* Конь\n");
				}
			case 2:
				if ((x1 - x2 <= 1 && x1 - x2 >= -1) && (y1 - y2 <= 1 && y1 - y2 >= -1) || (x1 == x2 || y1 == y2) || (((x1 + y1) % 2 == 0 && (x2 + y2) % 2 == 0) || ((x1 + y1) % 2 == 1 && (x2 + y2) % 2 == 1)))
				{
					printf("* Ферзь\n");
					break;
				}
			default:
				{
				printf(" Ни одна фигура не может так сходить!");
				}
			}
		}
		}
	}
	else
	{
		printf("\nШахматная доска состоит 8x8 клеток, выберите другую клетку");
	}
	return 0;
}